import 'package:masbaha_app/features/home/data/models/adhker_model.dart';

const List<AdhkerModel> adhkerList = [
  AdhkerModel(
    title:
        'لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شيء قدير',
    hadith:
        ':قال رسول الله صلى الله عليه وسلم \n خير الدعاء دعاء يوم عرفه ، وخير ما قلت أنا والنبيون من قبلي \nلا إله إلا الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شيء قدير',
  ),
  AdhkerModel(
    title: 'اللهمَّ إنك عفوٌّ تُحبُّ العفوَ فاعفُ عنِّي',
    hadith:
        'قلتُ : يا رسولَ اللهِ أرأيتَ إن علمتُ أيَّ ليلةِ القدرِ ما أقولُ فيها ؟ قال : قولي : اللهمَّ إنك عفوٌّ تُحبُّ العفوَ فاعفُ عنِّي',
  ),
  AdhkerModel(
    title: 'سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته',
    hadith:
        'قال ﷺ:\n ” لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن : \n سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته “',
  ),
  AdhkerModel(
    title: 'اللهم صل وسلم على نبينا محمد',
    hadith: 'قال ﷺ: \n “من صلى عليَّ صلاة صلى الله عليه بها عشراً ” مسلم 384',
  ),
  AdhkerModel(
    title: 'أستغفر الله الذى لا إله إلا هو الحى القيوم وأتوب إليه',
    hadith: '',
  ),
  AdhkerModel(
    title:
        'اللَّهُمَّ إنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، ولَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ، فَاغْفِرْ لي مَغْفِرَةً مِن عِندِكَ، وارْحَمْنِي، إنَّكَ أنْتَ الغَفُورُ الرَّحِيم',
    hadith: '',
  ),
  AdhkerModel(
    title: 'رب اغفر لي',
    hadith: '',
  ),
  AdhkerModel(
    title: 'أستغفر الله',
    hadith:
        'قالَ رَسُولُ اللَّهِ ﷺ: منْ لَزِم الاسْتِغْفَار، جَعَلَ اللَّه لَهُ مِنْ كُلِّ ضِيقٍ مخْرجًا، ومنْ كُلِّ هَمٍّ فَرجًا، وَرَزَقَهُ مِنْ حيْثُ لاَ يَحْتَسِبُ رواه أبو داود',
  ),
  AdhkerModel(
    title: 'سبحان الله و الحمد الله و لا إله إلا الله و الله أكبر',
    hadith:
        'قال النبيُّ ﷺ: ( لأن أقول: سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر، أحبُّ إليَّ مما طلعت عليه الشَّمس ) ',
  ),
  AdhkerModel(
    title: 'سبحان الله وبحمده سبحان الله العظيم',
    hadith:
        'قال ﷺ: \n ” كلمتان خفيفتان على اللسان ثقيلتان في الميزان حبيبتان إلى الرحمن سبحان الله وبحمده سبحان الله العظيم ”',
  ),
  AdhkerModel(
    title: 'سبحان الله العظيم وبحمده',
    hadith: 'قال ﷺ:\n “من قال سبحان الله العظيم وبحمده غرست له نخلة في الجنة”',
  ),
  AdhkerModel(
    title: 'سبحان الله',
    hadith:
        'قال ﷺ: \n ” أيعجز أحدكم أن يكسب كل يوم ألف حسنة فسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة قال : يسبح الله مائة تسبيحة فيكتب له ألف حسنة أو يحط عنه ألف خطيئة ” رواه مسلم',
  ),
  AdhkerModel(
    title: 'لا حول ولا قوة إلا بالله',
    hadith:
        'قال ﷺ: يا عبدالله بن قيس “ألا أدلك على كنز من كنوز الجنة ؟ قال: بلى يا رسول الله ! قال: قل (لا حول ولا قوة إلا بالله) ”',
  ),
  AdhkerModel(
    title: 'سبحان الله والحمد لله ولا إله إلا الله والله أكبر',
    hadith: 'أحب الكلام إلى الله لا يضر بأيهن بدأت',
  ),
  AdhkerModel(
    title: 'سبحان الله وبحمده',
    hadith:
        'قال ﷺ:\n ” من قال سبحان الله وبحمده في يوم مئة مرة حطت خطاياه وإن كانت مثل زبد البحر “',
  ),
];
